Tekla Open API Reference for Tekla Structures 2025
AnalysisModelModalAnalysisProperties.ModalAnalysisModel Property
 Indicates whether a modal analysis model is used.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ModalAnalysisModel { get; set; }
Public Property ModalAnalysisModel As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnalysisModelModalAnalysisProperties Class
Tekla.Structures.Analysis Namespace